Revit 2026 API

# IFCLinkDocumentExportScope Constructor

---

Instantiates a default IFCLinkDocumentExportScope object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCLinkDocumentExportScope(
	Document pADoc
)
```
```vb
Public Sub New (
	pADoc As Document
)
```
```cpp
public:
IFCLinkDocumentExportScope(
	Document^ pADoc
)
```
```fsharp
new :
        pADoc : Document -> IFCLinkDocumentExportScope
```

#### Parameters

pADoc Document
     The linked document to export.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCLinkDocumentExportScope Class

Autodesk.Revit.DB.IFC Namespace